package gr.aueb.softeng.view.Owner.HomePage;

public interface OwnerHomePageView {
    /**
     * Καλεί το νέο activity το οποίο προσθέτει ένα νέο εστιατόριο στον ιδιοκτήτη
     */
    void AddRestaurant();
    /**
     * Καλείται όταν η λίστα με τα εστιατόρια του ιδιοκτήτη είναι άδεια , ώστε να εμφανιστεί το μήνυμα ειδοποίησης στην
     * οθόνη και να κρυφτεί το recycler view που θα είναι άδειο ούτως ή αλλος
     */
    void ShowNoRestaurants();
    /**
     * Καλείται όταν η λίστα με τα εστιατόρια του ιδιοκτήτη ΔΕΝ είναι άδεια , και εμφανίζει τα αντικείμενα
     * του recycler view , και παράλληλα κρύβει το μήνυμα που θα εμφανιζόταν εάν ήταν άδεια η λίστα
     */
    void ShowRestaurants();

    /**
     * επιστρέφει στο προηγούμενο activity που μας κάλεσε
     */
    void goBack();
}
